[
  {
    "id": "1",
    "image": "https://raw.githubusercontent.com/ShaHar91/Portfolio/master/public/avatar1.png",
    "full_name": "John Doe",
    "function": "Android Developer",
    "review": "I am incredibly fortunate to have such an inspiring mentor like Christiano. Their unwavering guidance and insightful advice have been the cornerstone of my professional growth. Their ability to navigate complex challenges with poise and their willingness to share knowledge has truly elevated my skills. Christiano leads with a perfect blend of patience and expertise, making them a true role model. Grateful for the opportunity to learn and be guided by the best!"
  },
  {
    "id": "2",
    "image": "https://raw.githubusercontent.com/ShaHar91/Portfolio/master/public/avatar2.png",
    "full_name": "Shrek",
    "function": "Android Lead",
    "review": "Working alongside Christiano has been an absolute privilege. Their tireless dedication to our team's growth and success is truly commendable. Christiano consistently goes above and beyond, readily offering assistance and putting in the effort to ensure our collective progress. As a coworker, their commitment to collaboration and their unwavering support make them an invaluable asset. Grateful to be part of a team led by someone who leads not just by words, but by inspiring actions."
  },
  {
    "id": "3",
    "image": "https://raw.githubusercontent.com/ShaHar91/Portfolio/master/public/avatar3.png",
    "full_name": "Fiona",
    "function": "Developer",
    "review": "It's a pleasure to express my admiration for Christiano. Their professionalism, dedication, and positive attitude create an incredible work environment. Christiano's exceptional ability to collaborate and communicate elevates team projects, making even complex tasks seem manageable. Their insightful contributions and willingness to assist showcase their remarkable work ethic. Truly grateful for the opportunity to work alongside someone who consistently sets a high standard for excellence."
  },
  {
    "id": "4",
    "image": "https://raw.githubusercontent.com/ShaHar91/Portfolio/master/public/avatar4.png",
    "full_name": "Donkey",
    "function": "Android Developer",
    "review": "Christiano was an invaluable asset to our team. Their exceptional skills and dedication consistently yielded outstanding results. Their proactive approach to challenges and ability to work harmoniously with colleagues showcased exemplary professionalism. Christiano truly exceeded expectations and significantly contributed to our success."
  },
  {
    "id": "5",
    "image": "https://raw.githubusercontent.com/ShaHar91/Portfolio/master/public/avatar5.png",
    "full_name": "Jane Doe",
    "function": "Customer/Testing Engineer",
    "review": "I had the pleasure of working closely with Christiano Bolla in the process of making an personalised tracker application. He was very aware of the requirements I had, we discussed them thoroughly and he was able to give me some insights and good suggestions that broadend my view. During the process we could communicate in a very productive and convivial way. He kept me updated, had intermediate updates and was very clear in what feature was possible or would be a little more difficult to achieve. The end result was a very nice looking, usability friendly and functional application. I also managed to get a glimps of his coaching attitude when he was explaining certain technical steps in a friendly and understandable, yet concrete, way to me. Since a recent amount of time I have started working more in IT myself, as a test engineer. He has been a supportive help in the process as after -support. This even states his way of working in an agile method more. I would definetly advice him to others!"
  }
]